export default {
  // Main Caption
  project_name: "Домовичок",
  home_caption: "Домовичок",
  history_caption: "История показаний",
  dispatch_caption: "Передача показаний",
  about_caption: "О программе",
  policy_caption: "Пользовательское соглашение",
  instruction_caption: "Инструкция",

  // MENU
  menu_instruction: "Инструкция",
  menu_policy: "Пользовательское соглашение",
  menu_settings: "Настройки",
  menu_about: "О программе",
  menu_exit: "В Ы Х О Д",

  // HOME
  home_profiles_empty_1: "У вас нет ни одного профиля!",
  home_profiles_empty_2: "Для создания профиля нажмите",
  home_profiles_empty_3: "на иконку",
  home_profiles_empty_4: "внизу экрана.",
  home_profiles_empty_5: "Для справки нажмите на ссылку:",
  home_profiles_empty_6: "Инструкция",

  // PROFILE
  profile_new_caption: "Создание профиля",
  profile_edit_caption: "Управление профилем",
  profile_name: "Наименование профиля:",
  profile_name_placeholder: "Укажите адрес проживания",
  profile_id: "Лицевой счет:",
  profile_id_placeholder: "Укажите лицевой счет",
  profile_fio: "Ф.И.О. клиента:",
  profile_fio_placeholder: "Укажите ваше Имя",
  profile_phone: "Контактный телефон:",
  profile_phone_placeholder: "Укажите контактный телефон",
  profile_kitchen: "Кухня",
  profile_kitchen_hot: "Горячая:",
  profile_kitchen_cold: "Холодная:",
  profile_bath: "Ванна-Туалет",
  profile_bath_hot: "Горячая:",
  profile_bath_cold: "Холодная:",
  profile_other: "Разное",
  profile_other_watering: "Полив:",
  profile_other_sewage: "Обратка:",
  profile_notes: "Примечание:",

  // DISPATCH
  dispatch_profile_name: "Профиль:",
  dispatch_modal_spinner: "Запрос обрабатывается...",
  dispatch_modal_home: "На главную",

  // HISTORY
  history_records_empty: "Нет данных",
  history_record_caption: "Дата отправки:",

  // SETTINGS
  settings_caption: "Настройки",
  settings_lang: "Язык приложения",
  settings_theme: "Цветовая схема",
  settings_theme_light: "Светлая",
  settings_theme_dark: "Темная",
  settings_profile: "Профили",
  settings_profile_details: "Отображать детали профиля",

  // POLICY
  policy_header: "Политика конфиденциальности",
  policy_company: "ООО «Taurus Quadra»",
  policy_city: "г. Славутич",
  policy_date: "Введено в действие 2.10.2020 г",
  policy_foreword: "Настоящий документ «Политика конфиденциальности» (далее — по тексту — «Политика») представляет собой правила использования Обществом с ограниченной ответственностью «Taurus Quadra» (далее — «TQ») персональной информации Пользователя.",

  policy_first_paragraph: "1. Общие положения",
  policy_first_subparagraph1: "1.1. Настоящая Политика является неотъемлемой частью Пользовательского соглашения (далее — «Соглашение»), размещенного и/или доступного в сети Интернет по адресу: http://tau-quadra.com/#/privacyPolicy, а также иных заключаемых с Пользователем договоров, когда это прямо предусмотрено их условиями.",
  policy_first_subparagraph2: "1.2. Заключая Соглашение вы свободно, своей волей и в своих интересах даете письменное согласие на следующие способы обработки Персональной информации: сбор, запись, систематизация, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение в установленных настоящей Политикой целях с использованием средств автоматизации или без использования таких средств по усмотрению TQ.",
  policy_first_subparagraph3: "1.3. К настоящей Политике, включая толкование ее положений и порядок принятия, исполнения, изменения и прекращения, подлежит применению законодательство Украины.",
  policy_first_subparagraph4: "1.4. Здесь и далее в Политике используются термины и определения, предусмотренные Соглашением, а также иными заключаемыми с Пользователем договорами, если иное не предусмотрено настоящей Политикой или не вытекает из ее существа. В иных случаях толкование применяемого в Политике термина производится в соответствии с действующим законодательством Украины, обычаями делового оборота, или научной доктриной.",

  policy_second_paragraph: "2. Персональная информация",
  policy_second_subparagraph1: "2.1. Под персональной информацией в настоящей Политике понимается:",
  policy_second_subparagraph1_1: "2.1.1. Информация, которую Пользователь предоставляет о себе самостоятельно при заполнении профиля, а также в процессе дальнейшего использования Приложения, включая персональные данные Пользователя.",
  policy_second_subparagraph1_2: "2.1.2. Данные, которые передаются в автоматическом режиме в зависимости от настроек программного обеспечения Пользователя в обезличенном виде.",
  policy_second_subparagraph2: "2.2. TQ вправе устанавливать требования к составу Персональной информации Пользователя, которая должна обязательно предоставляться для использования Приложения и основанного на нем Сервиса. Если определенная информация не помечена TQ как обязательная, ее предоставление или раскрытие осуществляется Пользователем по своему усмотрению.",
  policy_second_subparagraph3: "2.3. При регистрации Пользователем обязательно указываются лицевой счет, мобильный телефон. В целях правильной работы приложения Пользователь также может предоставить следующие персональные данные о себе: имя, фамилию, адрес проживания.",
  policy_second_subparagraph4: "2.4. TQ не осуществляет проверку достоверности предоставляемой Персональной информации и наличия у Пользователя необходимого согласия на ее обработку в соответствии с настоящей Политикой, полагая, что Пользователь действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в актуальном состоянии и получению всех необходимых согласий cубъектов персональных данных.",
  policy_second_subparagraph5: "2.5. TQ осуществляет сбор и хранение данных о действиях Пользователя в приложении, используя при этом файлы журналов.",
  policy_second_subparagraph6: "2.6. Пользователь осознает и принимает возможность использования в Мобильном приложении программное обеспечение, в результатe чего TQ имеет возможность получать данные указанные в п.2.1.2 данные в обезличенном виде.",

  policy_third_paragraph: "3. Цели обработки Персональной информации",
  policy_third_subparagraph1: "3.1. TQ осуществляет обработку, в том числе сбор и хранение той Персональной информации, которая необходима для заключения и исполнения договоров с Пользователем.",
  policy_third_subparagraph2: "3.2. TQ вправе использовать Персональную информацию в следующих целях:",
  policy_third_subparagraph2_1: "3.2.1. Реализация функциональных возможностей по созданию и отображению в Приложении профиля Пользователя. TQ хранит, систематизирует и отображает в Приложении профили Пользователей, содержащие Персональную информацию, которую Пользователи указали.",
  policy_third_subparagraph2_2: "3.2.2. Заключение договоров на использование Приложения; Заключение Договора осуществляется в дистанционном порядке посредством скачивания приложения.",
  policy_third_subparagraph2_3: "3.2.3. Использование обезличенных данных для улучшения работы приложения и повышения качества предоставляемых услуг.",

  policy_fourth_paragraph: "4. Требования к защите Персональной информации",
  policy_fourth_subparagraph1: "4.1. TQ осуществляет хранение Персональной информации и обеспечивает ее охрану от несанкционированного доступа и распространения в соответствии с внутренними правилами и регламентами.",
  policy_fourth_subparagraph2: "4.2. В отношении Персональной информации Пользователя сохраняется ее конфиденциальность.",
  policy_fourth_subparagraph3: "4.3. TQ вправе передавать Персональную информацию третьим лицам в следующих случаях:",
  policy_fourth_subparagraph3_1: "4.3.1. Передача необходима в рамках использования Пользователем функциональных возможностей Приложения.",
  policy_fourth_subparagraph3_2: "4.3.2. По запросу суда или иного уполномоченного государственного органа в рамках установленной законодательством процедуры;",
  policy_fourth_subparagraph3_3: "4.3.3. Для защиты прав и законных интересов TQ в связи с нарушением заключенных с Пользователем договоров.",

  policy_fifth_paragraph: "5. Изменение Персональной информации",
  policy_fifth_subparagraph1: "5.1. Пользователь вправе в любой момент самостоятельно отредактировать в своем Личном кабинете предоставленную им при регистрации или авторизации Персональную информацию.",
  policy_fifth_subparagraph2: "5.2. В случае прекращения заключенного договора, Пользователь вправе удалить собственную учетную запись.",

  policy_sixth_paragraph: "6. Изменение Политики конфиденциальности",
  policy_sixth_subparagraph1: "6.1. Настоящая Политика может быть изменена или прекращена TQ в одностороннем порядке без предварительного уведомления Пользователя. Новая редакция Политики вступает в силу с момента ее размещения на Сайте TQ, если иное не предусмотрено новой редакцией Политики.",
  policy_sixth_subparagraph2: "6.2. Действующая редакция Политики находится на Сайте TQ в сети Интернет по адресу http://tau-quadra.com/#/privacyPolicy.",

  // INSTRUCTION
  // ----------------------------------------------------------------------------------------
  // LOCALE TEXT STRING IN HERE:
  help_exit: "Выйти из инструкции",
  // ----------------------------------------------------------------------------------------

  // ABOUT
  about_appName: "ДОМОВИЧОК",
  about_appDisclaimer: "Данное приложение разработано в г. Славутич и работать оно будет только для водоканала г.Славутич.",
  about_appPhone: "Телефон водоканала: 2-22-22",
  about_appLink: "Ссылка на сайт водоканала: https://vodaslav.com.ua/",
  about_appVersion: "Версия: v2.0.1",

  // ACTIONS
  action_ok: "Да",
  action_cancel: "Отмена",

  // INFORMATION
  info_warning: "Внимание!",
  info_profile_delete: "Вы хотите удалить профиль и связанную с ним историю переданных показаний?",
  info_profile_save: "Cохранить введенные вами изменения?",
  info_dispatch_success: "Показания счетчиков успешно отправлены на сервер и сохраненны в Историю",
  info_history_delete: "Вы хотите очистить всю историю переданных показаний?",

  // VALIDATION
  valid_main_caption: "Ошибка проверки данных!",
  valid_profile_unique: "Профиль с указанным адресом и/или лицевым счетом уже существуют в приложении.",
  valid_profile_invalid_id: "Лицевой счет не должен быть меньше 10 цифр.",
  valid_profile_address_empty: "Адрес не указан.",
  valid_profile_enumerators_unchecked: "Ни один из счетчиков не выбран.",
  valid_dispatch_required: "Обязательное поле \"#\" не заполненно.",

  // ERRORS
  err_main_caption: "Ошибка!",
  // ERRORS:HOME
  err_home_build_list: "Объекты 'Profiles', 'Locale', 'Styles' и/или 'Navigation' не определенны!",
  // ERRORS:PROFILE
  err_profile_delete: "Возникла ошибка при удалении профиля:",
  // ERRORS:DISPATCH
  err_dispatch_save_history: "Показания счетчиков успешно отправлены на сервер, но возникла ошибка при сохранении показаний в историю:",
  err_dispatch_send_firebase: "При попытке отправить показания сервер вернул ошибку",
  // ERRORS:PERIOD
  err_dispatch_save_period: "Показания счетчиков успешно отправлены на сервер, но возникла ошибка при обновлений периода подачи показаний:",
  // ERRORS:HISTORY
  err_history_delete: "При очистке истории возникла ошибка:",
  err_history_build: "Объекты 'History', 'Navigation', 'Route', 'Locale' и/или 'Styles' не определенны!",
  err_history_sort: "Возникла ошибка при попытке отсортировать историю показаний:",

}
