export default {
  // MAIN CAPTION
  project_name: "Домовичок",
  home_caption: "Домовичок",
  history_caption: "Історія показників",
  dispatch_caption: "Передача показників",
  about_caption: "Довідка",
  policy_caption: "Політика конфіденційності",
  instruction_caption: "Інструкція",

  // MENU
  menu_instruction: "Інструкція",
  menu_policy: "Політика конфіденційності",
  menu_settings: "Налаштування",
  menu_about: "Довідка",
  menu_exit: "В И Х І Д",

  // HOME
  home_profiles_empty_1: "У вас немає жодного профілю!",
  home_profiles_empty_2: "Для створення профілю натисніть",
  home_profiles_empty_3: "на іконку",
  home_profiles_empty_4: "внизу екрану",
  home_profiles_empty_5: "Для довідки натисніть на посилання:",
  home_profiles_empty_6: "Інструкція",

  // PROFILE
  profile_new_caption: "Створення профілю",
  profile_edit_caption: "Управління профілем",
  profile_name: "Найменування профілю:",
  profile_name_placeholder: "Вкажіть адресу проживання",
  profile_id: "Особовий рахунок:",
  profile_id_placeholder: "Вкажіть 10 цифр особового рахунку",
  profile_fio: "ПІБ користувача:",
  profile_fio_placeholder: "Вкажіть повне iм'я",
  profile_phone: "Контактний телефон:",
  profile_phone_placeholder: "Вкажіть контактний номер телефону",
  profile_kitchen: "Кухня",
  profile_kitchen_hot: "Гаряча вода:",
  profile_kitchen_cold: "Холодна вода:",
  profile_bath: "Ванна-туалет",
  profile_bath_hot: "Гаряча вода:",
  profile_bath_cold: "Холодна вода:",
  profile_other: "Різне",
  profile_other_watering: "Полив:",
  profile_other_sewage: "Стоки:",
  profile_notes: "Примітка:",

  // DISPATCH
  dispatch_profile_name: "Профіль:",
  dispatch_modal_spinner: "Запит обробляється...",
  dispatch_modal_home: "На головну",

  // HISTORY
  history_records_empty: "Даних немає",
  history_record_caption: "Дата вiдправлення:",
  history_filter: "Вкажiть календарний перiод",

  // SETTINGS
  settings_caption: "Налаштування",
  settings_lang: "Мова додатку",
  settings_theme: "Кольорова схема",
  settings_theme_light: "Свiтла",
  settings_theme_dark: "Темна",
  settings_profile: "Профiлi",
  settings_profile_details: "Відображати деталі профілю",

  // POLICY  
  policy_header: "Політика конфіденційності",
  policy_company: "ТОВ 'ТАУРУС КВАДРО'",
  policy_city: "м. Славутич",
  policy_date: "Введено в дію 02.10.2020 року",
  policy_foreword: "Цей документ 'Політика конфіденційності' (далі - за текстом - 'Політика') являє собою правила використання Товариством з обмеженою відповідальністю 'ТАУРУС КВАДРО' (далі- ТОВ 'ТАУРУС КВАДРО') персональної інформації Користувача.",

  policy_first_paragraph: "1. Загальні положення",
  policy_first_subparagraph1: "1.1. Дана Політика є невід'ємною частиною Угоди (далі - 'Угода'), розміщенної і/або доступної в мережі Інтернет за адресою: https://tau-quadra.com/privacy-policy, а також інших укладених з Користувачем договорів, коли це прямо передбачено їх умовами. ",
  policy_first_subparagraph2: "1.2. Укладаючи Угоду Ви вільно, своєю волею і в своїх інтересах даєте письмову згоду на такі способи обробки Персональної інформації: збір, запис, систематизація, зберігання, уточнення (оновлення, зміна), витяг, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення, у встановлених цією Політикою цілях з використанням засобів автоматизації або без використання таких засобів на розсуд ТОВ 'ТАУРУС КВАДРО'.",
  policy_first_subparagraph3: "1.3. До цієї Політики, включаючи тлумачення її положень і порядок прийняття, виконання, зміни та припинення, підлягає застосуванню законодавство України.",
  policy_first_subparagraph4: "1.4. Тут і далі в Політиці використовуються терміни та визначення, передбачені Угодою, а також іншими укладенними з Користувачем договорами, якщо інше не передбачено цією Політикою або не випливає з її суті. В інших випадках тлумачення застосовуваного в Політиці терміну проводиться відповідно до чинного законодавства України, звичаями ділового обороту, або науковою доктриною.",

  policy_second_paragraph: "2. Персональна інформація",
  policy_second_subparagraph1: "2.1. Під персональними даними в цій Політиці розуміється:",
  policy_second_subparagraph1_1: "2.1.1. Інформація, яку Користувач надає про себе самостійно при заповненні профілю, а також в процесі подальшого використання Програми, включаючи персональні дані Користувача.",
  policy_second_subparagraph1_2: "2.1.2. Дані, які передаються в автоматичному режимі в залежності від налаштувань програмного забезпечення Користувача в знеособленому вигляді.",
  policy_second_subparagraph2: "2.2. ТОВ 'ТАУРУС КВАДРО' має право встановлювати вимоги до складу Персональної інформації Користувача, яка повинна обов'язково надаватися для використання Програми та заснованого на ньому Сервісу. Якщо певна інформація не зазначена ТОВ 'ТАУРУС КВАДРО' як обов'язкова, її надання або розкриття здійснюється Користувачем на власний розсуд.",
  policy_second_subparagraph3: "2.3. При реєстрації Користувачем обов'язково вказується особовий рахунок. З метою належного функціонування програми, Користувач також може надати такі персональні дані про себе: ім'я, прізвище, адресу проживання, мобільний телефон.",
  policy_second_subparagraph4: "2.4. ТОВ 'ТАУРУС КВАДРО' не проводить перевірку достовірності наданої Персональної інформації та наявності у Користувача необхідної згоди на її обробку, відповідно до цієї Політики, вважаючи, що Користувач діє сумлінно, обачно і докладає всіх необхідних зусиль до підтримання такої інформації в актуальному стані і отримання всіх необхідних погоджень cуб'єктів персональних даних.",
  policy_second_subparagraph5: "2.5. ТОВ 'ТАУРУС КВАДРО' здійснює збір та зберігання даних про дії Користувача у додатку, використовуючи при цьому файли журналів.",
  policy_second_subparagraph6: "2.6. Користувач усвідомлює і приймає можливість використання в Мобільному додатку програмне забезпечення, в результаті чого ТОВ 'ТАУРУС КВАДРО' має можливість отримувати дані, зазначені в п.2.1.2 (дані в знеособленому вигляді).",

  policy_third_paragraph: "3. Цілі обробки Персональної інформації",
  policy_third_subparagraph1: "3.1. ТОВ 'ТАУРУС КВАДРО' здійснює обробку, в тому числі збір та зберігання, тієї Персональної інформації, яка необхідна для укладання та виконання договорів з Користувачем.",
  policy_third_subparagraph2: "3.2. ТОВ 'ТАУРУС КВАДРО' вправі використовувати Персональну інформацію в наступних цілях:",
  policy_third_subparagraph2_1: "3.2.1. Реалізація функціональних можливостей по створенню та відображенню в Додатку профілю Користувача. ТОВ 'ТАУРУС КВАДРО' зберігає, систематизує та відображає в Додатку профілі користувачів, що містять Персональну інформацію, яку Користувачі вказали.",
  policy_third_subparagraph2_2: "3.2.2. Укладання договорів на використання Програми; Укладання Договору здійснюється в дистанційному порядку шляхом скачування програми.",
  policy_third_subparagraph2_3: "3.2.3. Використання знеособлених даних для поліпшення роботи програми та підвищення якості послуг, що надаються.",

  policy_fourth_paragraph: "4. Вимоги до захисту Персональної інформації",
  policy_fourth_subparagraph1: "4.1. ТОВ 'ТАУРУС КВАДРО' здійснює зберігання Персональної інформації та забезпечує її охорону від несанкціонованого доступу і поширення відповідно до внутрішніх правил та регламентів.",
  policy_fourth_subparagraph2: "4.2. Відносно Персональної інформації Користувача зберігається її конфіденційність.",
  policy_fourth_subparagraph3: "4.3. ТОВ 'ТАУРУС КВАДРО' має право передавати Персональну інформацію третім особам в наступних випадках:",
  policy_fourth_subparagraph3_1: "4.3.1. Передача необхідна в рамках використання Користувачем функціональних можливостей Програми.",
  policy_fourth_subparagraph3_2: "4.3.2. За запитом суду або іншого уповноваженого державного органу в рамках встановленої законодавством процедури.",
  policy_fourth_subparagraph3_3: "4.3.3. Для захисту прав і законних інтересів ТОВ 'ТАУРУС КВАДРО', у зв'язку з порушенням укладених з Користувачем договорів.",

  policy_fifth_paragraph: "5. Зміна Персональної інформації",
  policy_fifth_subparagraph1: "5.1. Користувач має право в будь-який момент самостійно відредагувати в своєму Особистому кабінеті надану їм при реєстрації або авторизації Персональну інформацію.",
  policy_fifth_subparagraph2: "5.2. У разі припинення укладеного договору, Користувач має право видалити власний обліковий запис.",

  policy_sixth_paragraph: "6. Зміна Політики конфіденційності",
  policy_sixth_subparagraph1: "6.1. Ця Політика може бути змінена або припинена ТОВ 'ТАУРУС КВАДРО' в односторонньому порядку без попереднього повідомлення Користувача. Нова редакція Політики вступає в силу з моменту її розміщення на Сайті ТОВ 'ТАУРУС КВАДРО', якщо інше не передбачено новою редакцією Політики.",
  policy_sixth_subparagraph2: "6.2. Чинна редакція Політики знаходиться на Сайті ТОВ 'ТАУРУС КВАДРО' в мережі Інтернет за адресою: \nhttps://tau-quadra.com/privacy-policy. ",
  policy_link: "https://tau-quadra.com/privacy-policy",
  
	// INSTRUCTION
  help_exit: "Вийти з інструкції",
  help_main_page: "Головна сторінка",
  help_main_page_text_1: "Це сторінка, де зберігатимуться всі Ваші профілі.",
  help_main_page_text_2: "Зліва зверху є кнопка, яка викликає навігацію.",
  help_main_page_text_3: "Так буде виглядати головна сторінка з одним профілем:",
  help_main_page_text_4: "Для редагування/видалення профілю або перегляду історії переданих показників натисніть на сам профіль.",
  help_main_page_text_5: "Щоб перейти до передачі показників, потрібно у обраного профілю натиснути кнопку переходу до сторінки передачі показників лічильників.",

  help_profile_page: "Профіль",
  help_profile_foreword: "Створивши профіль необхідно одноразово вказати розташування лічильників та зберегти дані. Подальша робота з додатком передбачає лише заповнення показників обраних лічильників. Додатком передбачено можливість створення декількох профілів. (1 профіль -1 квартира).",
  help_profile_paragraph: "Дані для  створення профілю:",
  help_profile_paragraph_1_1: "1. Найменування профілю - потрібно для того, щоб Ви могли відрізнити один профіль від іншого.",
  help_profile_paragraph_1_2: "Для цього пропонуємо назвою профілю робити адресу житла, дані лічильників якого ви будете передавати.",
  help_profile_paragraph_2: "2. Особовий рахунок - це 10 цифр, які вказані в розрахунковому документі за воду. Це найважливіше поле, без нього КП 'СЛАВУТИЧ-ВОДОКАНАЛ' не отримає ваші показники. Це поле обов’язкове для заповнення.",
  help_profile_paragraph_3: "3. ПІБ - ця інформація не є обов’язковою, але її наявність допоможе працівникам КП 'СЛАВУТИЧ-ВОДОКАНАЛ' уточнити інформацію по переданим даним, якщо виникнуть питання.",
  help_profile_paragraph_4: "4. Контактний телефон (у форматі 0ХХ ХХ ХХ ХХХ). Ця інформація не є обов’язковою, але її наявність допоможе спростити зв'язок КП 'СЛАВУТИЧ-ВОДОКАНАЛ' з Вами, якщо з'явиться така потреба.",
  help_profile_heatmeter_details: "Далі йде блок, в якому потрібно вказати лічильники, показники яких будуть передаватися. Лічильники обираються в залежності від їх розміщення (наприклад, якщо у вас в кухні стоїть  лічильник холодної води - просто оберіть  лічильник 'Холодна вода' у відповідному  розділі 'Кухня').",
  help_profile_save: "Щоб закінчити створення профілю - натисніть кнопку збереження у вигляді дискети.",

  help_send_page: "Передача показників",
  help_send_foreword: "Щоб перейти до передачі показників, потрібно навпроти профілю натиснути кнопку переходу до сторінки передачі показників лічильників.",
  help_send_text_1: "Ця сторінка буде відображати поля для введення показників тих лічильників, які були обрані при створенні цього профілю. Поряд з кожним полем для введення поточних показників лічильників, в системі відображаються попередні показники лічильників, якщо вони були передані за допомогою цього додатку.",
  help_send_text_2: "Поле 'Примітка' надано для того, щоб вказати додаткову інформацію, наприклад, якщо у Вас є третій лічильник в кімнаті.",
  help_send_text_3: "Для відправки даних натисніть на Кнопку  передачі показників у вигляді листа.",

  help_history_page: "Історія",
  help_history_foreword: "На сторінку історії можна потрапити зі сторінки профілю.",
  help_history_condition: "Після одноразової передачі показників, кнопка 'Історія' буде доступною. Дані показників зберігатимуться протягом року з дати передачі перших показників. Ви можете впорядкувати дані від найстаріших, до найновіших і навпаки. Для цього внизу праворуч є необхідна кнопка у вигляді стрілок сортування.",
  help_history_calendar: "Ви можете зробити фільтрування по даті передачі показників, за допомогою кнопки у вигляді календаря.",
  help_history_delete: "Кнопка у вигляді смітника видаляє всю вашу історію. Вибіркового видалення не передбачено.",
  help_period: "Період передачі показників",
  help_show_period: "При натисканні кнопки оновлення періоду у вигляді стрілочок, Ви можете стежити за оновленням періоду передачі показників, який може змінюватися в КП 'СЛАВУТИЧ-ВОДОКАНАЛ'.",

  // ABOUT
  about_disclaimer: "Цей додаток розроблено в м.Славутич і працюватиме він тільки для КП 'СЛАВУТИЧ-ВОДОКАНАЛ' м.Славутич.",
  about_telephone: "Телефон КП 'СЛАВУТИЧ-ВОДОКАНАЛ':",
  about_telephone_2: "+38(04579) 2-26-55",
  about_link: "Посилання на сайт КП 'СЛАВУТИЧ-ВОДОКАНАЛ': ",
  about_link_2: "https://vodaslav.com.ua/",
  about_version: "Версія: v2.0.2",

  // ACTIONS
  action_ok: "Так",
  action_cancel: "Вiдмiна",
  action_apply: "Застосувати",

  // INFORMATION
  info_warning: "Увага!",
  info_profile_delete: "Ви дійсно бажаєте видалити профіль і пов'язану з ним історію переданих показників?",
  info_profile_save: "Зберегти введені Вами зміни?",
  info_profile_without_save: "Ви дійсно бажаєте вийти зі сторінки створення профілю без збереження даних?",
  info_dispatch_success: "Показники лічильників успішно відправлено на сервер і збережено в історію",
  info_dispatch_unperiod_notification: "Зверніть увагу! Ви передаєте показники лічильників не у встановлений КП 'СЛАВУТИЧ-ВОДОКАНАЛ' період передачі показників.",
  info_history_delete: "Ви дійсно бажаєте очистити всю історію переданих показників?",
  info_period_update_head: "Ви успішно оновили період подачі відомостей лічильників.",
  info_period_update_descr: "Поточний період передачі показників лічильників: з #begin# по #end# число кожного місяця.",

  // VALIDATION
  valid_main_caption: "Помилка перевірки даних!",
  valid_profile_unique: "Профіль з вказаною адресою та/або особовим рахунком вже існують в додатку.",
  valid_profile_invalid_id: "Особовий рахунок не повинен налічувати менше ніж 10 цифр.",
  valid_profile_address_empty: "Адресу не вказано.",
  valid_profile_enumerators_unchecked: "Жоден з лічильників не обраний.",
  valid_dispatch_required: "Обов'язкове поле '#' не заповнено.",

  // ERRORS
  err_main_caption: "Помилка!",
  // LINK
  err_check_link: "Помилка при підключенні до мережевого ресурсу. Перевірте підключення до Інтернету.",
  // ERRORS:HOME
  err_home_build_list: "Об'єкти 'Profiles', 'Locale', 'Styles' та/або 'Navigation' не визначені!",
  err_home_period_update: "Без підключення до мережі Інтернет додатком автоматично не оновлено період передачі показників. Для самостійного оновлення цього періоду перейдіть до пункту меню 'Інструкція'.",
  // ERRORS:PROFILE
  err_profile_delete: "Виникла помилка при видаленні профілю:",
  // ERRORS:DISPATCH
  err_dispatch_save_history: "Показники лічильників успішно відправлено на сервер, але виникла помилка при збереженні показників в історію:",
  err_dispatch_send_firebase: "При спробі відправити показники сервер повернув помилку",
  // ERRORS:PERIOD
  err_dispatch_period_save: "Виникла помилка при оновленнi періоду подачі показників.",
  err_dispatch_period_get: "Помилка при спробі отримати період подачі показників з бази даних.",
  // ERRORS:HISTORY
  err_history_delete: "При очищенні історії виникла помилка:",
  err_history_build: "Об'єкти 'History', 'Navigation', 'Route', 'Locale' та/або 'Styles' не визначені!",
  err_history_sort: "Виникла помилка при спробі впорядкувати історію показників.",
  err_history_filter: "Виникла помилка при спробі відфільтрувати історію показників.",
	// ERRORS:HISTORY
  err_about_link: "Неможливо відкрити цю URL-адресу:",
}
